Тест_загрузки/src/InformationRegisters/ДанныеРасчета/ДанныеРасчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеРасчета</name>
  <dimensions>
    <name>Дата_Прибытие</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дата_Убытие</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодТипаОбработки</name>
    <type>
      <types>EnumRef.КодыТиповОбработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерГрузовогоМеста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЕдиницыОбработки</name>
    <type>
      <types>EnumRef.ВидУслуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтпСклМс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Тест_загрузки/src/Enums/ВидУслуги/ВидУслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидУслуги</name>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>Обработка</name>
  </enumValues>
</mdclass:Enum>

Тест_загрузки/src/CommonModules/ОбработкаФайлов/Module.bsl
&НаСервере
Процедура ЗаписатьВРегистрДанные(АдресДанных, МассивКолонок, ИндексНачала, РазмерПорции) Экспорт

	Разделитель = ",";
	
	ДвоичныеДанные = АдресДанных;
	
	ПотокДанных = ДвоичныеДанные.ОткрытьПотокДляЧтения();	
	
	Результат = Новый ТаблицаЗначений;
	
	Для каждого ТекКолонка Из МассивКолонок Цикл
	
		Результат.Колонки.Добавить(Вычислить(ТекКолонка));
	
	КонецЦикла;
	
	Текст = Новый ЧтениеТекста(ПотокДанных, "UTF-8");	
	
	СчетчикСтрок = 1;
	
	ЧислоЭлементовВТранзакции = 1000;
	
	СчетчикЭлементов = 0;
	
	ТекСтрока = Текст.ПрочитатьСтроку();
	
	Пока НЕ ТекСтрока = Неопределено Цикл
		
		Если СчетчикЭлементов = 0 Тогда
			
			НачатьТранзакцию();
			
		КонецЕсли;
		
		Если (СчетчикСтрок >= ИндексНачала) И (СчетчикСтрок <= (ИндексНачала + РазмерПорции - 1))   Тогда
			
			НовСтрока = Результат.Добавить();
			НоваяСтрока = РегистрыСведений.ДанныеРасчета.СоздатьМенеджерЗаписи();
			
			МассивЗначений = СтрРазделить(ТекСтрока, Разделитель);
			
			ИндексКолонки = 0;
			
			Для Каждого ТекЗначение Из МассивЗначений Цикл
				
				НовСтрока[ИндексКолонки] = ТекЗначение;
				
				ИндексКолонки = ИндексКолонки + 1;
				
			КонецЦикла;
			
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НовСтрока);
			
			НоваяСтрока.Дата_Прибытие    = Вычислить("'" + НовСтрока.Дата_Прибытие + " " + НовСтрока.Время_Прибытие + "'");
			НоваяСтрока.Дата_Убытие      = Вычислить("'" + НовСтрока.Дата_Убытие   + " " + НовСтрока.Время_Убытие + "'");
			НоваяСтрока.КодТипаОбработки = Вычислить("Перечисления.КодыТиповОбработки." + НовСтрока.КодТипаОбработки);
			
			Если ВРег(СокрЛП(НовСтрока.ИдентификаторЕдиницыОбработки)) = "X" Тогда
			
				НоваяСтрока.ИдентификаторЕдиницыОбработки = Перечисления.ВидУслуги.Хранение;
				
			Иначе	
				
				НоваяСтрока.ИдентификаторЕдиницыОбработки = Перечисления.ВидУслуги.Обработка;
			
			КонецЕсли;
			
			НоваяСтрока.Записать();
			
			Результат.Очистить();
			
		ИначеЕсли СчетчикСтрок > (ИндексНачала + РазмерПорции - 1) Тогда	
			
			Прервать;
			
		КонецЕсли;
		
		ТекСтрока = Текст.ПрочитатьСтроку();		
		
		СчетчикЭлементов = СчетчикЭлементов + 1;
		Если СчетчикЭлементов % ЧислоЭлементовВТранзакции = 0 Тогда
			
			Если ТранзакцияАктивна() Тогда
				
				ЗафиксироватьТранзакцию();
				
			КонецЕсли;
			
			СчетчикЭлементов = 0;
		
		КонецЕсли;
		
		СчетчикСтрок = СчетчикСтрок + 1;
	
	КонецЦикла;

	Если ТранзакцияАктивна() Тогда
	
		ЗафиксироватьТранзакцию();
	
	КонецЕсли;
	
КонецПроцедуры
